src/clojars-worklog/2023/index.org
#+TITLE: Clojars Worklog - 2023
#+AUTHOR: Toby Crawley
#+EMAIL: toby@tcrawley.org
#+OPTIONS:   num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../worklog-style.css" />

* Intro
  :PROPERTIES:
  :CUSTOM_ID: intro
  :END:

This worklog covers work performed on [[https://clojars.org][Clojars]] under a contract from
the [[https://www.clojuriststogether.org/][Clojurists Together Foundation]]. The contract covers general maintenance.

* August 2023
  :PROPERTIES:
  :CUSTOM_ID: aug-2023
  :END:

*Commit Logs:* [[https://github.com/clojars/clojars-web/compare/5fdef58b17d710fdf6b2ea886a520c84e45af624...0a5eb2175e7b417fc9e64bcb6fb87f6d15cbddbc][~clojars-web~]], [[https://github.com/clojars/infrastructure/compare/5d2811bdfd95cf1320af2a2bea2fed2ce0cf9b87...ad8335b312a81567a4c78ef4fe1587741794534c][~infrastructure~]]

I took this month to clean up some long-standing issues:

+ [[https://github.com/clojars/clojars-web/issues/659][Fixed an issue with error reporting from the repository routes]]
+ [[https://github.com/clojars/clojars-web/issues/563][Include release date for each version in feed.clj]]
+ [[https://github.com/clojars/clojars-web/issues/564][Include scm tag for each version in feed.clj]]
+ [[https://github.com/clojars/clojars-web/issues/823][Require MFA group wide to deploy]]

And a few quality of life improvements:

+ [[https://github.com/clojars/clojars-web/commit/0d33a469744f71aa965eac40c6a9cdebd44edefa][Add denylist to email sender]]
+ [[https://github.com/clojars/clojars-web/pull/872][Migrate from project.clj to deps.edn]]
+ [[https://github.com/clojars/clojars-web/commit/0a5eb2175e7b417fc9e64bcb6fb87f6d15cbddbc][Upgraded to latest clj-kondo for code linting]]

The [[https://github.com/clojars/clojars-web/blob/main/CHANGELOG.org][CHANGELOG file]] also covers any user-facing changes.
