src/clojars-worklog/2023/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-29 Tue 20:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Clojars Worklog - 2023</title>
<meta name="author" content="Toby Crawley" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../worklog-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Clojars Worklog - 2023</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#intro">Intro</a></li>
<li><a href="#aug-2023">August 2023</a></li>
</ul>
</div>
</div>

<div id="outline-container-intro" class="outline-2">
<h2 id="intro">Intro</h2>
<div class="outline-text-2" id="text-intro">
<p>
This worklog covers work performed on <a href="https://clojars.org">Clojars</a> under a contract from
the <a href="https://www.clojuriststogether.org/">Clojurists Together Foundation</a>. The contract covers general maintenance.
</p>
</div>
</div>

<div id="outline-container-aug-2023" class="outline-2">
<h2 id="aug-2023">August 2023</h2>
<div class="outline-text-2" id="text-aug-2023">
<p>
<b>Commit Logs:</b> <a href="https://github.com/clojars/clojars-web/compare/5fdef58b17d710fdf6b2ea886a520c84e45af624...0a5eb2175e7b417fc9e64bcb6fb87f6d15cbddbc"><code>clojars-web</code></a>, <a href="https://github.com/clojars/infrastructure/compare/5d2811bdfd95cf1320af2a2bea2fed2ce0cf9b87...ad8335b312a81567a4c78ef4fe1587741794534c"><code>infrastructure</code></a>
</p>

<p>
I took this month to clean up some long-standing issues:
</p>

<ul class="org-ul">
<li><a href="https://github.com/clojars/clojars-web/issues/659">Fixed an issue with error reporting from the repository routes</a></li>
<li><a href="https://github.com/clojars/clojars-web/issues/563">Include release date for each version in feed.clj</a></li>
<li><a href="https://github.com/clojars/clojars-web/issues/564">Include scm tag for each version in feed.clj</a></li>
<li><a href="https://github.com/clojars/clojars-web/issues/823">Require MFA group wide to deploy</a></li>
</ul>

<p>
And a few quality of life improvements:
</p>

<ul class="org-ul">
<li><a href="https://github.com/clojars/clojars-web/commit/0d33a469744f71aa965eac40c6a9cdebd44edefa">Add denylist to email sender</a></li>
<li><a href="https://github.com/clojars/clojars-web/pull/872">Migrate from project.clj to deps.edn</a></li>
<li><a href="https://github.com/clojars/clojars-web/commit/0a5eb2175e7b417fc9e64bcb6fb87f6d15cbddbc">Upgraded to latest clj-kondo for code linting</a></li>
</ul>

<p>
The <a href="https://github.com/clojars/clojars-web/blob/main/CHANGELOG.org">CHANGELOG file</a> also covers any user-facing changes.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Crawley</p>
<p class="date">Created: 2023-08-29 Tue 20:11</p>
</div>
</body>
</html>